---
kind: type
id: T:Autodesk.Revit.DB.MEPAnalyticalConnectionType
source: html/a0840c90-ffe0-fc59-7af3-022967128828.htm
---
# Autodesk.Revit.DB.MEPAnalyticalConnectionType

Represents an analytical connection type between mechanical equipment and piping network.

## Syntax (C#)
```csharp
public class MEPAnalyticalConnectionType : ElementType
```